/*******************************************************************************
*通用程序框架* 						   *
* Author: QExpand; ShiJin                                                        *
* Date: 2023/10/32    														   *
* Revision:	 														 		   *
*******************************************************************************/
#include "UserCanComm.h"
#include "UserForkLiftProc_ChuFeng.h"
#include "ErrCode.h"
#include "Eeprom.h"
#include "IQmathLib.h"
#include "PropProc.h"
#include "CanRevProc.h"
#include "string.h"
#include "Para.h"
#include "WdgProc.h"
#include "math.h"
#include "Log.h"
#include "LocalAi.h"
#include "LedProc.h"
#include "AiProc.h"
#include "LocalDo.h"
#include "HourCount.h"
#include "BatteryMeter.h"
#include "BeepProc.h"
#include "AlarmLamp.h"
#include "AngleSensor.h"
#include "PressureSensor.h"
#include "string.h"
#include "Para.h"
#include "WdgProc.h"
#include "math.h"
#include "Log.h"
#include "LocalAi.h"
#include "PcuProc.h"
//#include "UserCommon.h"




#if (USER_TYPE == USER_CHUFENG_2IN1_LOGIC)
/*参数配置部分*/

/*报文配置*/
const static xPdoParameter  sgPdoPara = 
{		/*标准CanOpen，100，200，300，400/+nodeid*/
		/*u8Type为0xFF时周期发送*/
		/*特殊报文请用i32CanWrite周期发送*/
	.TpdoPara = {
		{.u8Flag = 1, .u8Type = 0xFF, .u16Period = 50},
		{.u8Flag = 0, .u8Type = 0x00, .u16Period = 50},
		{.u8Flag = 0, .u8Type = 0x00, .u16Period = 50},
		{.u8Flag = 0, .u8Type = 0x00, .u16Period = 50},
		{.u8Flag = 0, .u8Type = 0x00, .u16Period = 20, .u16CanId = 0X000 },
		{.u8Flag = 0, .u8Type = 0x00, .u16Period = 50, .u16CanId = 0x000 },
		{.u8Flag = 0, .u8Type = 0x00, .u16Period = 50, .u16CanId = 0x000 },
		{.u8Flag = 0, .u8Type = 0x00, .u16Period = 50, .u16CanId = 0x000 },
		{.u8Flag = 0, .u8Type = 0x00, .u16Period = 50, .u16CanId = 0x000 },
		{.u8Flag = 0, .u8Type = 0x00, .u16Period = 50, .u16CanId = 0x000 },
	},
	/*Canopen接收*/
	/*设置对应id及使能*/
	.RpdoPara = {
		{.b1Flag = 0, .b11CanRevId = 0x000},
		{.b1Flag = 0, .b11CanRevId = 0x000},
		{.b1Flag = 0, .b11CanRevId = 0x000},
		{.b1Flag = 0, .b11CanRevId = 0x000},
		{.b1Flag = 0, .b11CanRevId = 0x000},
		{.b1Flag = 0, .b11CanRevId = 0x000},
	},
};

/*开关量输入*/
typedef union
{
	uint8_t u8data;
	struct
	{
		uint8_t b1PcuSwi: 1;
		uint8_t b1TiltSwi: 1;
		uint8_t b1PitSwi: 1;
		uint8_t b1UpLimitSwi: 1;
		uint8_t b1DownLimitSwi: 1;
		uint8_t b1LowerCtlUp:1;
		uint8_t b1LowerCtlDown: 1;
	};
}xSwiInput;

/*PCU Input*/
typedef union
{
	uint8_t u8data;
	struct
	{
		uint8_t b1MoveMode:1;
		uint8_t b1LiftMode:1;
		uint8_t b1Slow:1;
		uint8_t b1Speaker:1;
		uint8_t b1TurnLeft:1;
		uint8_t b1TurnRight:1;
		uint8_t b1Enable:1;
		uint8_t b1Reserve:1;
	};
}xPCUInfo;

/*动作限制设置*/
typedef union
{
	uint16_t u8Data;
	struct
	{
		uint8_t b1Init:1;
		uint8_t b1BMS_Erro:1;
		uint8_t b1SteerErro:1;
		uint8_t b1Error:1;
		uint8_t b1LogicSequnce:1;
		uint8_t b1CanIDlost1:1;
		uint8_t b1CanIDlost2:1;
		uint8_t b1FirmwareFailure:1;
	};
}xAct;

typedef union
{
	uint8_t u8Data;
	struct
	{
		uint8_t b1Init:1;
		uint8_t b1Act:1;
		uint8_t b1Warning:1;
		uint8_t b1Error:1;
		uint8_t b7Rserve1:4;
	};
}xMove;

typedef union
{
	uint8_t u8Data;
	struct
	{
		uint8_t b1Init:1;
		uint8_t b1Act:1;
		uint8_t b1Warning:1;
		uint8_t b1Error:1;
		uint8_t b7Rserve1:4;
	};
}xSteer;

typedef union
{
	uint8_t u8Data;
	struct
	{
		uint8_t b1Init:1;
		uint8_t b1Act:1;
		uint8_t b1BMSWarning:1;
		uint8_t b1HeightLimit:1;
		uint8_t b1TiltError:1;
		uint8_t b1Error:1;
		uint8_t b7Rserve1:1;
	
	};
}xLift;

typedef union
{
	uint8_t u8Data;
	struct
	{
		uint8_t b1AfterLift:1;
		uint8_t b1Slow:1;
		uint8_t b1SpdLowBat:1;
		uint8_t b1Steer:1;
		uint8_t b4Rserve:4;
	};
}xSpd;

typedef union
{
	uint8_t u8Data;
	struct
	{
		uint8_t b1Act:1;
		uint8_t b1OrbitRate:1;
		uint8_t b1Tilt:1;
		uint8_t b6Rserve:5;
	};
}xPumpSpd;

typedef union
{
	uint8_t u8Data;
	struct
	{
		uint8_t b1Act:1;
		uint8_t b1OrbitRate:1;
		uint8_t b1Error:1;
		uint8_t b6Rserve:5;
	};
}xDown;

typedef struct
{
	xAct Action;
	xMove Movement;
	xLift Lift;
	xSpd SpeedRate; 
	xPumpSpd PumpRate;
	xSteer SteerLock;
	xDown Down;
}xActLimit;

/*输出动作逻辑*/
typedef union
{
	uint8_t u8Data;	
	struct
	{
		/*行走动作逻辑*/
		uint8_t b1ForwardAct:1;
		uint8_t b1BackwardAct:1;
		uint8_t b1LiftUpAct:1;
		uint8_t b1LiftDownAct:1;
		uint8_t b1TurnLeft:1;
		uint8_t b1TurnRight: 1;
		uint8_t b2Reserve2:2;
	};
}xActLogic;


/*转弯降速*/
typedef struct
{
	uint16_t	u16StartAngle;
	uint16_t	u16EndAngle;
	uint16_t	u16StartAngleSpd;
	uint16_t	u16EndAngleSpd;
	float		fAgnleDecSpdFactor;
}xSteerAngleDecSpd;

/*上位机配置参数*/
typedef struct
{
	uint8_t		u8FastDriveSpeed;
	uint8_t		u8SlowDriveSpeed;
	uint8_t		u8DriveSpeedAfterLift;
	uint8_t		u8LiftSpeed;				
	uint8_t		u8MaxTurnSpeed;			
	uint8_t		u8TurnPowerLimit;			
	uint8_t		u8DeadZoneAdjust;			

	uint8_t		u8BrakeFastDrive;			
	uint8_t		u8BrakeSlowDrive;			
	uint8_t		u8BrakeDriveAfterLift;	
	uint8_t		u8BrakeLift;				
	uint8_t		u8BrakeLower;				
	uint8_t		u8BrakeTurn;				
	uint8_t		u8BrakeAntiPinch;

//	uint8_t		u8Reserve1;					/*14*/
//	uint8_t		u8Reserve2;					/*15*/

	uint8_t		u8LowerSpeed;				/*16*/			
	uint8_t		u8OverLoadStabilityDelay;	
	uint8_t		u8DynamicOverLoadPercent;	
	uint8_t		u8StaticOverLoadPercent;	
	uint8_t		u8MaxDifferencePercent;	
	uint8_t		u8DriveMotorEncoder;		
	uint8_t		u8MotorHighSpeedDeceRate;	
	uint8_t		u8MotorLowSpeedDeceRate;	
	uint8_t		u8VoiceAlarmVolume;		

	uint8_t		u8CurveFastDrive;						
	uint8_t		u8CurveSlowDrive;			
	uint8_t		u8CurveDriveAfterLift;	
	uint8_t		u8CurveLift;				
	uint8_t		u8CurveLower;
	
//	uint8_t		u8Reserve3;					/*30*/
//	uint8_t		u8Reserve4;					/*31*/	

	uint8_t		u8CurveTurn;					/*32*/

	uint8_t		u8AccAndDecFastDrive;				
	uint8_t		u8AccAndDecSlowDrive;		
	uint8_t		u8AccAndDecAfterLift;		
	uint8_t		u8AccAndDecLift;			
	uint8_t		u8AccAndDecLower;			
	uint8_t		u8AccAndDecTurn;			
	uint8_t		u8AccAndDecAntiPinch;		

	uint8_t		u8PumpMotorEncoder;					

	uint8_t		u8VehicleType;							
	uint8_t		u8VehcileHeight;			
	uint8_t		u8PressureSensorType;		
	uint8_t		u8PitProtectFunc;			
	uint8_t		u8AntiPinchFunc;

//	uint8_t		u8Reserve5;					/*46*/
//	uint8_t		u8Reserve6;					/*47*/
	
	uint8_t		u8ActAlmFunc;				/*48*/				
	uint8_t		u8WeighFunc;				
	uint8_t		u8ParallelValveReverseFunc;
	uint8_t		u8LowBatAlmFunc;			
	uint8_t		u8LowVolAlmTime;			
	uint8_t		u8LowVolShutDownTime;		
	uint8_t		u8UpperCtlButSleep;		
	uint8_t		u8LanguageType;			
	uint8_t		u8BatteryType;			
	uint8_t		u8SpeakerSync;			
	uint8_t		u8LowerPumpType;			
	uint8_t		u8PressureType;			
	uint8_t		u8AngleSimulationLimit;	
	uint8_t		u8LiftReverseFunc;

//	uint8_t		u8Reserve7;				/*62*/
//	uint8_t		u8Reserve8;				/*63*/
	
	uint8_t		u8FourPointWeightFunc;	/*64*/	
	uint8_t		u8DriverType;			
	uint8_t		u8PasswordLock;			
	uint8_t		u8InAndOutFunc;			
	uint8_t		u8HeartBeatQueryFunc;		
	uint8_t		u8LowBatteryMode;			
	uint8_t		u8AngleSensorSetting;		
	uint8_t		u8TiltSwitchSetting;		
	uint8_t		u8AngleSensorType;		
	uint8_t		u8AnaLogLimitDetSwitch;	

	uint8_t		u8IsNoLoadCalibration;					
	uint8_t		u8IsOverLoadCalibration;	

	uint16_t		u16SetDescentHeightValue;		
	uint8_t		u8ReleaseBrake;

//	uint8_t		u8Reserve9;				/*78*/
//	uint8_t		u8Reserve10;				/*79*/
	
	uint16_t		u8SetOutHeight;			/*80*/
	uint16_t		u8AngleSimulationUpLimit;	
	uint16_t		u8AngleSimulationDownLimit;
	
//	uint16_t		u8PumpDriveCurrentLimitRatio0;			
//	uint16_t		u8PumpSpdAccRatio0;
//	uint16_t		u8PropDKp0;						
//	uint16_t		u8PropDKi0;						
//	uint16_t		u8PropDMaxCurrent0;				
//	uint16_t		u8PropDMinCurrent0;
//	uint16_t		u8PropDAccPeriod0;
//	uint16_t		u8PropDDitherPeriod0;	
//	uint16_t		u8PropDDitherRatio0;			
//	uint16_t		u8PropValveResistance0;
//	
//	uint8_t		u8Reserve11;					/*93*/
//	uint8_t		u8Reserve12;					/*94*/
//	uint8_t		u8Reserve13;					/*95*/
//	
//	
//	uint16_t		u8PumpDriveCurrentLimitRatio1;		/*96*/	
//	uint16_t		u8PumpSpdAccRatio1;
//	uint16_t		u8PropDKp1;						
//	uint16_t		u8PropDKi1;						
//	uint16_t		u8PropDMaxCurrent1;				
//	uint16_t		u8PropDMinCurrent1;
//	uint16_t		u8PropDAccPeriod1;
//	uint16_t		u8PropDDitherPeriod1;	
//	uint16_t		u8PropDDitherRatio1;			
//	uint16_t		u8PropValveResistance1;
	
	uint16_t		u16CanBaudRate;

	uint16_t		u8EmptyPressure;
	uint16_t		u8FullPressure;
	uint16_t		u8DriverFlag;
	
//	uint8_t		u8Reserve14;					/*110*/
//	uint8_t		u8Reserve15;					/*111*/
	
	uint16_t		u8MinAngle;					/*112*/
	uint16_t		u8MaxAngle;
	uint16_t		u8BatSocPalyBack;
	uint16_t		u8ValveType;
	uint16_t		u8AnticollisionFunc;
	uint16_t		u8ValueOpenLoopCurrent;
	uint16_t		u8ValueOpenPercentage;
	uint16_t		u16CanOpenNodeId;

	
	uint16_t		u8AngleValue0;
	uint16_t		u8AngleValue1;
	uint16_t		u8AngleValue2;
	uint16_t		u8AngleValue3;
	uint16_t		u8AngleValue4;
	uint16_t		u8AngleValue5;
	uint16_t		u8AngleValue6;
	uint16_t		u8AngleValue7;
	

	uint8_t		u8LogLevel;					/*138 log level*/
	uint8_t		u8LogModel;					/*139*/
	uint8_t		u8MotorMaxSpd;				/*140*/
	
	uint8_t		u8Analog3DeadZoneMinVal;		/*141*/
	uint8_t		u8Analog3DeadZoneMaxVal;		/*142*/
	uint8_t		u8Analog3MidVal;				/*143*/
	
	uint8_t		u8ThrottleType;					/*144 加速器类型*/
	uint8_t		u8ThrottleFDeadZoneMinVal;		/*踏板正向死区最小值（0.1V）*/
	uint8_t		u8ThrottleFDeadZoneMaxVal;		/*踏板正向死区最大值（0.1V）*/
	uint8_t		u8ThrottleFMidVal;				/*踏板正向中值对应输出百分比（1%）*/
	uint8_t		u8ThrottleBDeadZoneMinVal;		/*踏板反向死区最小值（0.1V）*/
	uint8_t		u8ThrottleBDeadZoneMaxVal;		/*踏板反向死区最大值（0.1V）*/
	uint8_t		u8ThrottleBMidVal;				/*踏板反向中值对应输出百分比（1%）*/
	
	uint8_t		u8BrakeType;						/*制动踏板输入类型*/
	uint8_t		u8BrakeFDeadZoneMinVal;			/*制动踏板正向死区最小值（0.1V）*/
	uint8_t		u8BrakeFDeadZoneMaxVal;			/*制动踏板正向死区最大值（0.1V）*/
	uint8_t		u8BrakeFMidVal;					/*制动踏板正向中值对应输出百分比（1%）*/
	uint8_t		u8BrakeBDeadZoneMinVal;			/*制动踏板反向死区最小值（0.1V）*/
	uint8_t		u8BrakeBDeadZoneMaxVal;			/*制动踏板反向死区最大值（0.1V）*/
	uint8_t		u8BrakeBMidVal;					/*制动踏板反向中值对应输出百分比（1%）*/
	
//	uint8_t		u8Reserve16;						/*158*/
//	uint8_t		u8Reserve17;						/*159*/
	
	uint8_t		u8Gear1Spd;						/*160 1档速度(%)*/
	uint8_t		u8Gear2Spd;						/*2档速度(%)*/
